[
  {
    "id": 1,
    "name": "Jakarta Urban Transit Management System",
    "slug": "jakarta-transit-management",
    "region": "Southeast Asia",
    "country": "Indonesia",
    "description": "Developed a comprehensive transit management dashboard for Jakarta's public transportation network, handling real-time data from 200+ bus routes and 50+ train stations.",
    "contribution": "Built the entire frontend interface using HTML5, CSS3, and vanilla JavaScript, implementing real-time data visualization with Chart.js. Created responsive layouts that work seamlessly on mobile devices used by transit operators. Optimized API calls to Python backend, reducing load times by 40%. Fixed critical bugs in route calculation algorithms and implemented error handling for network failures.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Chart.js", "REST API"],
    "year": 2021,
    "isCaseStudy": true,
    "image": "/images/projects/jakarta-transit.jpg"
  },
  {
    "id": 2,
    "name": "Manila E-Commerce Platform for Local Artisans",
    "slug": "manila-artisan-platform",
    "region": "Southeast Asia",
    "country": "Philippines",
    "description": "Created a full-stack e-commerce solution connecting local Filipino artisans with international buyers, featuring multi-currency support and localized payment gateways.",
    "contribution": "Designed and implemented the complete user interface using modern CSS Grid and Flexbox layouts. Developed JavaScript shopping cart functionality with local storage persistence. Built Python backend APIs for product management, order processing, and payment integration. Implemented image optimization techniques reducing page load times by 55%. Created responsive design ensuring optimal experience across all device types.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "SQLite", "Payment Gateway API"],
    "year": 2021,
    "isCaseStudy": true,
    "image": "/images/projects/manila-artisan.jpg"
  },
  {
    "id": 3,
    "name": "Bucharest Healthcare Appointment System",
    "slug": "bucharest-healthcare-appointments",
    "region": "Eastern Europe",
    "country": "Romania",
    "description": "Developed a digital appointment booking system for a network of 15+ clinics in Bucharest, reducing no-show rates by 30% through automated reminders and scheduling optimization.",
    "contribution": "Architected the frontend using semantic HTML5 and CSS3 with a focus on accessibility (WCAG 2.1 compliance). Implemented complex scheduling logic in JavaScript handling timezone conversions and multi-language support. Built secure Python REST APIs for appointment management with proper authentication. Created admin dashboard for clinic staff with real-time availability tracking. Optimized database queries reducing API response time by 50%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "FastAPI", "PostgreSQL", "JWT"],
    "year": 2022,
    "isCaseStudy": true,
    "image": "/images/projects/bucharest-healthcare.jpg"
  },
  {
    "id": 4,
    "name": "Lagos Agricultural Supply Chain Tracker",
    "slug": "lagos-agricultural-tracker",
    "region": "West Africa",
    "country": "Nigeria",
    "description": "Built a supply chain management system tracking agricultural products from farms to markets across Lagos state, improving traceability and reducing food waste by 25%.",
    "contribution": "Developed interactive data visualization dashboards using JavaScript and D3.js for supply chain analytics. Created responsive mobile-first design enabling field workers to update inventory using smartphones. Built Python backend with data processing scripts handling thousands of daily transactions. Implemented real-time GPS tracking integration for delivery vehicles. Optimized image compression for product photos, reducing storage costs by 35%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "D3.js", "GPS API"],
    "year": 2022,
    "isCaseStudy": true,
    "image": "/images/projects/lagos-agricultural.jpg"
  },
  {
    "id": 5,
    "name": "Ho Chi Minh City Smart Parking Solution",
    "slug": "hochiminh-smart-parking",
    "region": "Southeast Asia",
    "country": "Vietnam",
    "description": "Created an IoT-integrated smart parking management system for Ho Chi Minh City, connecting 500+ parking spaces with real-time availability tracking and mobile payment integration.",
    "contribution": "Designed intuitive user interface with HTML5 and CSS3 featuring real-time parking map visualization. Developed JavaScript frontend handling WebSocket connections for live updates. Built Python backend APIs processing sensor data from IoT devices. Implemented payment gateway integration supporting local Vietnamese payment methods. Created admin panel for parking operators with analytics and revenue tracking. Reduced average parking search time by 60% through intelligent routing algorithms.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "WebSocket", "IoT", "Payment API"],
    "year": 2023,
    "isCaseStudy": true,
    "image": "/images/projects/hochiminh-parking.jpg"
  },
  {
    "id": 6,
    "name": "Dhaka Textile Inventory Management",
    "slug": "dhaka-textile-inventory",
    "region": "South Asia",
    "country": "Bangladesh",
    "description": "Developed inventory management system for a textile manufacturing company in Dhaka, tracking raw materials and finished products across multiple warehouses.",
    "contribution": "Created comprehensive dashboard using HTML, CSS, and JavaScript with real-time inventory updates. Built Python scripts for automated inventory calculations and low-stock alerts. Implemented barcode scanning integration for quick product entry. Designed responsive interface for warehouse staff using tablets. Reduced inventory discrepancies by 45% through automated tracking.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Barcode API"],
    "year": 2021,
    "isCaseStudy": false,
    "image": "/images/projects/dhaka-textile.jpg"
  },
  {
    "id": 7,
    "name": "Sofia University Course Registration Portal",
    "slug": "sofia-university-portal",
    "region": "Eastern Europe",
    "country": "Bulgaria",
    "description": "Built online course registration system for Sofia University, handling enrollment for 10,000+ students across multiple faculties.",
    "contribution": "Developed user-friendly registration interface with HTML5 forms and CSS3 styling. Implemented JavaScript validation and dynamic course filtering. Created Python backend managing student enrollment data and course capacity. Built conflict detection system preventing double-booking. Reduced registration processing time from 2 weeks to 2 days.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "MySQL"],
    "year": 2021,
    "isCaseStudy": false,
    "image": "/images/projects/sofia-university.jpg"
  },
  {
    "id": 8,
    "name": "Nairobi Microfinance Loan Management",
    "slug": "nairobi-microfinance",
    "region": "East Africa",
    "country": "Kenya",
    "description": "Created loan management system for a microfinance institution in Nairobi, processing small loans for local entrepreneurs.",
    "contribution": "Designed clean interface using HTML and CSS for loan application and tracking. Built JavaScript calculators for interest and repayment schedules. Developed Python backend handling loan processing and payment tracking. Implemented SMS notification system for payment reminders. Created reporting dashboard for loan officers. Increased loan processing efficiency by 50%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "SMS API"],
    "year": 2022,
    "isCaseStudy": false,
    "image": "/images/projects/nairobi-microfinance.jpg"
  },
  {
    "id": 9,
    "name": "Bangkok Food Delivery Aggregator",
    "slug": "bangkok-food-delivery",
    "region": "Southeast Asia",
    "country": "Thailand",
    "description": "Developed food delivery platform aggregating multiple restaurants in Bangkok, featuring real-time order tracking and multi-restaurant cart functionality.",
    "contribution": "Created responsive web interface using HTML5, CSS3, and JavaScript with mobile-first design. Built dynamic menu system with filtering and search capabilities. Developed Python APIs for order management and restaurant integration. Implemented real-time order status updates using WebSocket. Created admin panel for restaurant owners. Optimized image loading reducing page load time by 40%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "FastAPI", "WebSocket"],
    "year": 2022,
    "isCaseStudy": false,
    "image": "/images/projects/bangkok-food.jpg"
  },
  {
    "id": 10,
    "name": "Warsaw Real Estate Listing Platform",
    "slug": "warsaw-real-estate",
    "region": "Eastern Europe",
    "country": "Poland",
    "description": "Built property listing website for Warsaw real estate market, featuring advanced search filters and virtual tour integration.",
    "contribution": "Designed property listing cards with HTML and CSS featuring image galleries. Implemented JavaScript search functionality with multiple filter combinations. Created Python backend managing property data and image storage. Built map integration showing property locations. Developed responsive design for mobile property browsing. Increased user engagement by 65% through improved UI/UX.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "Map API"],
    "year": 2022,
    "isCaseStudy": false,
    "image": "/images/projects/warsaw-realestate.jpg"
  },
  {
    "id": 11,
    "name": "Kuala Lumpur Event Management System",
    "slug": "kuala-lumpur-events",
    "region": "Southeast Asia",
    "country": "Malaysia",
    "description": "Created event management platform for Kuala Lumpur, handling ticketing, registration, and event promotion for local organizers.",
    "contribution": "Developed event listing pages with HTML5 and CSS3 featuring calendar integration. Built JavaScript ticketing system with seat selection for venues. Created Python backend processing ticket sales and generating QR codes. Implemented email notification system for event reminders. Designed mobile-responsive checkout process. Processed 50,000+ tickets in first 6 months.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "QR Code API", "Email API"],
    "year": 2022,
    "isCaseStudy": false,
    "image": "/images/projects/kuala-lumpur-events.jpg"
  },
  {
    "id": 12,
    "name": "Lima Construction Project Tracker",
    "slug": "lima-construction-tracker",
    "region": "South America",
    "country": "Peru",
    "description": "Developed project tracking system for construction company in Lima, monitoring progress across multiple building sites.",
    "contribution": "Created dashboard interface using HTML, CSS, and JavaScript with progress visualization. Built Python backend tracking construction milestones and resource allocation. Implemented photo upload system for site documentation. Developed reporting tools for project managers. Created mobile interface for on-site updates. Reduced project reporting time by 70%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "File Upload"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/lima-construction.jpg"
  },
  {
    "id": 13,
    "name": "Prague Language Learning Platform",
    "slug": "prague-language-learning",
    "region": "Eastern Europe",
    "country": "Czech Republic",
    "description": "Built online language learning platform for Czech language learners, featuring interactive exercises and progress tracking.",
    "contribution": "Designed interactive learning interface with HTML5 and CSS3 animations. Developed JavaScript quiz system with immediate feedback. Created Python backend managing user progress and lesson content. Implemented spaced repetition algorithm for vocabulary learning. Built progress visualization charts. Increased user retention by 55% through gamification elements.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Chart.js"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/prague-language.jpg"
  },
  {
    "id": 14,
    "name": "Colombo Freight Shipping Portal",
    "slug": "colombo-freight-shipping",
    "region": "South Asia",
    "country": "Sri Lanka",
    "description": "Created shipping management portal for freight company in Colombo, tracking cargo from port to destination across South Asia.",
    "contribution": "Developed tracking interface using HTML, CSS, and JavaScript with real-time status updates. Built Python backend integrating with shipping APIs and GPS tracking. Created document management system for shipping paperwork. Implemented notification system for delivery updates. Designed mobile-responsive interface for drivers. Reduced customer inquiry response time by 80%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "FastAPI", "GPS API"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/colombo-freight.jpg"
  },
  {
    "id": 15,
    "name": "Casablanca Restaurant POS System",
    "slug": "casablanca-restaurant-pos",
    "region": "North Africa",
    "country": "Morocco",
    "description": "Developed Point of Sale system for restaurant chain in Casablanca, handling orders, payments, and inventory management.",
    "contribution": "Created touch-friendly interface using HTML5 and CSS3 optimized for tablets. Built JavaScript order management system with split billing. Developed Python backend processing payments and updating inventory. Implemented receipt printing integration. Created reporting dashboard for restaurant managers. Reduced order processing time by 45%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Printer API"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/casablanca-pos.jpg"
  },
  {
    "id": 16,
    "name": "Hanoi Student Information System",
    "slug": "hanoi-student-system",
    "region": "Southeast Asia",
    "country": "Vietnam",
    "description": "Built student information management system for high school in Hanoi, tracking grades, attendance, and parent communication.",
    "contribution": "Designed admin interface using HTML and CSS for teachers and administrators. Developed JavaScript grade calculation and report generation. Created Python backend managing student records and academic data. Implemented parent portal with grade viewing access. Built automated attendance tracking system. Streamlined report generation from days to minutes.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "Email API"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/hanoi-student.jpg"
  },
  {
    "id": 17,
    "name": "Belgrade Library Management System",
    "slug": "belgrade-library-system",
    "region": "Eastern Europe",
    "country": "Serbia",
    "description": "Created digital library management system for public library in Belgrade, handling book cataloging and member services.",
    "contribution": "Developed catalog interface using HTML5, CSS3, and JavaScript with search functionality. Built Python backend managing book inventory and member records. Implemented barcode scanning for book checkout. Created reservation system for popular books. Designed member portal for online renewals. Increased book checkout efficiency by 60%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Barcode API"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/belgrade-library.jpg"
  },
  {
    "id": 18,
    "name": "Accra Mobile Money Integration",
    "slug": "accra-mobile-money",
    "region": "West Africa",
    "country": "Ghana",
    "description": "Developed mobile money payment integration for e-commerce platform in Accra, supporting local payment methods.",
    "contribution": "Created payment interface using HTML and CSS with secure form handling. Implemented JavaScript payment processing with multiple gateway support. Built Python backend integrating with mobile money APIs. Developed transaction verification and receipt generation. Created admin dashboard for transaction monitoring. Processed 100,000+ transactions in first year.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "FastAPI", "Payment Gateway"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/accra-mobilemoney.jpg"
  },
  {
    "id": 19,
    "name": "Bratislava Fitness Center Management",
    "slug": "bratislava-fitness-center",
    "region": "Eastern Europe",
    "country": "Slovakia",
    "description": "Built management system for fitness center in Bratislava, handling member registration, class scheduling, and equipment booking.",
    "contribution": "Designed member portal using HTML5 and CSS3 with modern UI. Developed JavaScript class booking system with calendar integration. Created Python backend managing memberships and schedules. Implemented automated reminder system for classes. Built equipment availability tracker. Increased class booking rates by 50%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "Calendar API"],
    "year": 2023,
    "isCaseStudy": false,
    "image": "/images/projects/bratislava-fitness.jpg"
  },
  {
    "id": 20,
    "name": "Phnom Penh Tourism Booking Platform",
    "slug": "phnom-penh-tourism",
    "region": "Southeast Asia",
    "country": "Cambodia",
    "description": "Created tourism booking platform for Phnom Penh, connecting travelers with local tour operators and accommodations.",
    "contribution": "Developed booking interface using HTML, CSS, and JavaScript with multi-step forms. Built Python backend managing tour packages and availability. Implemented payment processing with multiple currency support. Created review and rating system. Designed mobile-responsive interface for travelers. Increased bookings by 75% in first year.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Payment API"],
    "year": 2024,
    "isCaseStudy": false,
    "image": "/images/projects/phnom-penh-tourism.jpg"
  },
  {
    "id": 21,
    "name": "Tbilisi Taxi Dispatch System",
    "slug": "tbilisi-taxi-dispatch",
    "region": "Eastern Europe",
    "country": "Georgia",
    "description": "Developed taxi dispatch system for Tbilisi, connecting passengers with drivers through web and mobile interfaces.",
    "contribution": "Created driver and passenger interfaces using HTML5, CSS3, and JavaScript. Built real-time location tracking with JavaScript and WebSocket. Developed Python backend managing ride requests and driver assignments. Implemented fare calculation and payment processing. Created admin dashboard for fleet management. Reduced average wait time by 40%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "FastAPI", "WebSocket", "GPS"],
    "year": 2024,
    "isCaseStudy": false,
    "image": "/images/projects/tbilisi-taxi.jpg"
  },
  {
    "id": 22,
    "name": "Kampala Market Price Tracker",
    "slug": "kampala-market-tracker",
    "region": "East Africa",
    "country": "Uganda",
    "description": "Built market price tracking system for Kampala, monitoring commodity prices across multiple markets in real-time.",
    "contribution": "Developed price display interface using HTML, CSS, and JavaScript with data visualization. Created Python backend collecting and processing price data. Implemented price alert system for significant changes. Built comparison tools showing price differences across markets. Designed mobile interface for market vendors. Helped consumers save average of 15% on purchases.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "Chart.js"],
    "year": 2024,
    "isCaseStudy": false,
    "image": "/images/projects/kampala-market.jpg"
  },
  {
    "id": 23,
    "name": "Yerevan Job Portal",
    "slug": "yerevan-job-portal",
    "region": "Eastern Europe",
    "country": "Armenia",
    "description": "Created job portal for Yerevan connecting job seekers with employers, featuring resume builder and application tracking.",
    "contribution": "Designed job listing interface using HTML5 and CSS3 with advanced filtering. Built JavaScript resume builder with PDF export. Developed Python backend managing job postings and applications. Implemented matching algorithm connecting candidates with jobs. Created employer dashboard for application management. Facilitated 5,000+ successful job placements.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Django", "PDF API"],
    "year": 2024,
    "isCaseStudy": false,
    "image": "/images/projects/yerevan-jobs.jpg"
  },
  {
    "id": 24,
    "name": "Kathmandu Weather Alert System",
    "slug": "kathmandu-weather-alerts",
    "region": "South Asia",
    "country": "Nepal",
    "description": "Developed weather alert system for Kathmandu, providing early warnings for extreme weather conditions affecting agriculture and daily life.",
    "contribution": "Created alert dashboard using HTML, CSS, and JavaScript with real-time updates. Built Python backend processing weather data from multiple sources. Implemented SMS and email notification system. Developed map visualization showing affected areas. Created mobile-responsive interface for farmers. Reduced weather-related crop losses by 30%.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Python", "Flask", "SMS API", "Map API"],
    "year": 2024,
    "isCaseStudy": false,
    "image": "/images/projects/kathmandu-weather.jpg"
  },
  {
    "id": 25,
    "name": "IoT Smart Home Relay Control System",
    "slug": "smart-home-automation",
    "region": "Current Project",
    "country": "Global",
    "description": "A comprehensive IoT Smart Home Relay Control System where ESP32-C6 devices installed in every switch board control multiple relays (lights, fans, appliances). The system operates through a local mesh network without requiring internet, with mobile app control via BLE connectivity. Fully functional offline with optional cloud sync for remote access.",
    "contribution": "Developed unified ESP32-C6 firmware implementing mesh network management and BLE gateway functionality. Built complete Android mobile application with BLE scanning, device pairing, and real-time relay control. Implemented mesh network routing system enabling devices to communicate without internet connectivity. Created command routing logic where mobile app connects via BLE to nearest ESP device, which forwards commands through mesh network to target devices. Developed real-time status synchronization across all ESP devices and mobile app. Implemented offline-first architecture ensuring full functionality without Wi-Fi or internet. Built relay control drivers and device identification system. Created multi-user support allowing multiple family members to control devices simultaneously. Designed local state replication system for real-time updates across the network.",
    "technologies": ["ESP32-C6", "BLE", "Mesh Network", "Android", "Python", "Flask", "WebSocket", "IoT", "MQTT", "C++", "Arduino"],
    "year": 2024,
    "isCaseStudy": true,
    "image": "/images/projects/smart-home.jpg",
    "isCurrent": true
  }
]

